[
{
    "name": "Calf stretch",
    "image":"https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/36/wf619106-1-calf-stretch-468x263.jpg",
    "description": "Your calf muscle runs along the back of your lower leg. To stretch your calf muscles:<br>Stand at arm's length from a wall or a piece of sturdy exercise equipment. <br>-Place your right foot behind your left foot. <br>-Slowly bend your left leg forward, keeping your right knee straight and your right heel on the floor. <br>-Hold your back straight and your hips forward. Don't rotate your feet inward or outward. <br>-Hold for about 30 seconds.<br>Switch legs and repeat. <br>-To deepen the stretch, slightly bend your right knee as you bend your left leg forward."
},

{
    "name": "Hamstring stretch",
    "image": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/39/wf619106-5-hamstring-stretch-468x263.jpg",
    "description":"Your hamstring muscle runs along the back of your upper leg. To stretch your hamstring muscles:<br>Lie on the floor near the outer corner of a wall or a door frame. <br>Raise your left leg and rest your left heel against the wall. Keep your left knee slightly bent. <br>Gently straighten your left leg until you feel a stretch along the back of your left thigh. <br>Hold for about 30 seconds. <br>Switch legs and repeat. <br>As your flexibility increases, maximize the stretch by gradually scooting yourself closer to the wall or door frame."
},

{
    "name": "Quadriceps stretch",
    "image": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/36/wf619106-2-quadriceps-stretch-468x263.jpg",
    "description": "Your quadriceps muscle runs along the front of your thigh. To stretch your quadriceps muscles:<br> Stand near a wall or a piece of sturdy exercise equipment for support.<br> Grasp your ankle and gently pull your heel up and back until you feel a stretch in the front of your thigh. <br> Tighten your stomach muscles to prevent your stomach from sagging outward, and keep your knees close together.<br> Hold for about 30 seconds.<br> Switch legs and repeat."
},

{
    "name": "Hip flexor stretch",
    "image": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/39/wf619106-6-hip-flexor-stretch-468x263.jpg",
    "description": "Your hip flexors, which allow you to lift your knees and flex at the waist, are located on your upper thighs, just below your hipbones. To stretch your hip flexors:<br>Kneel on your right knee, cushioning your kneecap with a folded towel.<br>Place your left foot in front of you, bending your knee and placing your left hand on your left leg for stability.<br>Place your right hand on your right hip to avoid bending at the waist. Keep your back straight and abdominal muscles tight.<br>Lean forward, shifting more body weight onto your front leg. You'll feel a stretch in your right thigh.<br>Hold for about 30 seconds.<br>Switch legs and repeat."
},
{
    "name": "Iliotibial band (ITB) stretch",
    "image": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/39/wf6191067itbstretchv2468x263.jpg",
    "description": "The iliotibial band (ITB) is a band of tissue that runs along the outside of your hip, thigh and knee. To stretch your ITB:<br>Stand near a wall or a piece of sturdy exercise equipment for support.<br>Cross your left leg over your right leg at the ankle.<br>Extend your left arm overhead, reaching toward your right side. You'll feel a stretch along your left hip.<br>Hold for about 30 seconds.<br>Switch sides and repeat."
},
{
    "name": "Knee-to-chest stretch",
    "image": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/36/wf619106-3-knee-to-chest-stretch-468x263.jpg",
    "description": "The knee-to-chest stretch focuses on the muscles of your lower back. Avoid this stretch if you have osteoporosis because it may increase the risk of compression fractures in your vertebrae.<br>To do this stretch:<br>Lie on your back on a firm surface with the backs of your heels flat on the floor.<br>Gently pull one knee up to your chest until you feel a stretch in your lower back.<br>Bring the knee as close to your chest as comfortably possible.<br>Keep the opposite leg relaxed in a comfortable position."
},


{
    "name": "Shoulder stretch",
    "image": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/36/wf619106-4-shoulder-stretch-468x263.jpg",
    "description": "If the back of your shoulder is tight, you may be more likely to develop rotator cuff problems, especially if you golf or participate in overhead racket or throwing sports, such as tennis or baseball. To keep your shoulders flexible:\n\nBring your left arm across your body and hold it with your right arm, either above or below the elbow.\nHold for about 30 seconds.\nSwitch arms and repeat."
},
{
    "name": "Shoulder stretch with towel",
    "image": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/39/wf619106-8-shoulder-stretch-with-towel-468x263.jpg",
    "description": "Your shoulder's internal rotators are part of the group of muscles often used in overhead sports activities, such as a tennis serve or an overhead throw. To stretch these muscles:\n\nGrasp a rolled-up towel firmly with both hands, as shown.\nGently pull the towel toward the ceiling with your top hand. You'll feel a stretch in the shoulder of your opposite arm as your lower hand is gently pulled farther up your back.\nHold for about 30 seconds.\nSwitch hands and repeat."
},
{
    "name": "Neck stretch",
    "image": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2022/02/22/15/39/wf6191069neckstretchv2468x263.jpg",
    "description": "To stretch your neck:\n\nBend your head forward and slightly to the right.\nWith your right hand, gently pull your head downward. You'll feel a nice, easy stretch along the back left side of your neck.\nHold for about 30 seconds.\nRepeat on the opposite side."
}

]

